In [111]:
import pandas as pd
import numpy as np
values=[12,44,12,44,7,8]
values1=[33,7,8,54,33,90]
dic={'PAK':values,'SRI':values1}
dt=pd.DataFrame(dic,index=range(6),columns=['SRI','PAK','BANg'])
dt['BANg']=np.arange(6)
dt

   SRI  PAK  BANg
0   33   12     0
1    7   44     1
2    8   12     2
3   54   44     3
4   33    7     4
5   90    8     5

In [112]:
dt.iloc[2,[0,2]]

SRI     8
BANg    2
Name: 2, dtype: int64

In [113]:
f=lambda x:x.max()-x.min()
df=dt.apply(f)
df

SRI     83
PAK     37
BANg     5
dtype: int64

In [114]:
d1=pd.DataFrame(np.arange(9).reshape(3,3),index=list('abc'))
d2=pd.DataFrame(np.arange(12).reshape(4,3),index=list('cade'))
d1

   0  1  2
a  0  1  2
b  3  4  5
c  6  7  8

In [115]:
d2

   0   1   2
c  0   1   2
a  3   4   5
d  6   7   8
e  9  10  11

In [116]:
d2+d1

     0    1     2
a  3.0  5.0   7.0
b  NaN  NaN   NaN
c  6.0  8.0  10.0
d  NaN  NaN   NaN
e  NaN  NaN   NaN

In [117]:
d2.drop('c',axis=0)

   0   1   2
a  3   4   5
d  6   7   8
e  9  10  11

In [118]:
def mix(data):
    d=pd.Series([data.max()-data.min()],index=['minimum'])
    return d
#d1.apply(mix,axis=1)
d1.apply(mix)

         0  1  2
minimum  6  6  6

In [119]:
d2.sort_index()

   0   1   2
a  3   4   5
c  0   1   2
d  6   7   8
e  9  10  11

In [120]:
d2.sort_index(axis=1,ascending=False)

    2   1  0
c   2   1  0
a   5   4  3
d   8   7  6
e  11  10  9

In [121]:
d2.sort_values(by=2)

   0   1   2
c  0   1   2
a  3   4   5
d  6   7   8
e  9  10  11

In [122]:
dt.rank(ascending=False,method='max',axis=0)

   SRI  PAK  BANg
0  4.0  4.0   6.0
1  6.0  2.0   5.0
2  5.0  4.0   4.0
3  2.0  2.0   3.0
4  4.0  6.0   2.0
5  1.0  5.0   1.0

In [123]:
dt.mean(axis=1)

0    15.000000
1    17.333333
2     7.333333
3    33.666667
4    14.666667
5    34.333333
dtype: float64

In [124]:
dt

   SRI  PAK  BANg
0   33   12     0
1    7   44     1
2    8   12     2
3   54   44     3
4   33    7     4
5   90    8     5

In [125]:
dt['PAK'].unique()
dt['BANg'].value_counts()
dt['PAK'].sum()

127

In [141]:
s=pd.Series(['Orange','Mango','Cherrey'],index=[0,3,6])
print(s)
print()
s=s.reindex(range(9),method='ffill')
print(s)

0     Orange
3      Mango
6    Cherrey
dtype: object

0     Orange
1     Orange
2     Orange
3      Mango
4      Mango
5      Mango
6    Cherrey
7    Cherrey
8    Cherrey
dtype: object

0     Orange
1        NaN
2        NaN
3      Mango
4        NaN
5        NaN
6    Cherrey
7        NaN
8        NaN
dtype: object

In [159]:
p=pd.DataFrame(np.arange(9).reshape(3,3),index=list('acd'),columns=list('abc'))
p

   a  b  c
a  0  1  2
c  3  4  5
d  6  7  8

In [160]:
p=p.reindex(list('abcd'))
print(p)

     a    b    c
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  3.0  4.0  5.0
d  6.0  7.0  8.0

In [162]:
p=p.reindex(list('abcd'),method='bfill')
print(p)

     a    b    c
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  3.0  4.0  5.0
d  6.0  7.0  8.0